{"quiz": {"q": [{"content": "According to the radio commentator, there are people gathering tonight\n            around the center of town to protest the recent tax increases. Since you\n            disagree with the tax increases, you should join the protestors tonight.", "answer": [{"@correct": "1", "#text": "Argument"}, {"@correct": "0", "#text": "Not an argument --- Purely expository passage"}, {"@correct": "0", "#text": "Not an argument. Pure expression of belief"}, {"@correct": "0", "#text": "Not an argument. Conditional statement in isolation."}], "explanation": "This is an argument. Here are the premises and the conclusion labeled:  \n    \n\t    P1) According to the radio commentator, there are people gathering \n\t    tonight around the center of town to protest the recent tax increases.\n    \n            P2) You disagree with the tax increases. (**Premise Indicator**: \"since\")\n    \n            C) Therefore, you should join the protestors tonight."}, {"content": "If you mix the ingredients properly and bake it at the right\n    \ttemperature, then so long as the oven works properly the cake will come\n    \tout fine.", "answer": [{"@correct": "1", "#text": "Not an argument. Conditional in isolation."}, {"@correct": "0", "#text": "Argument"}, {"@correct": "0.5", "#text": "Not an argument. Pure expression of belief."}, {"@correct": "0.5", "#text": "Not an argument. Command."}], "explanation": "This is not an argument. \n\n\t    It is just a single conditional (\"if-then\") statement in isolation."}, {"content": "My favorite singer from the 70s is either Debbie Harry or David\n    \tBowie. If it's Debbie Harry then all of my favorite singers, from every\n    \tdecade, are women. Well, now that I think about it, I'm sure my favorite\n    \tsinger from the 70s is not David Bowie. So, I guess all my favorite\n\t    singers, from every decade, *are* women.", "answer": [{"@correct": "1", "#text": "Argument"}, {"@correct": "0", "#text": "Not an argument. Pure statement of belief."}, {"@correct": "0", "#text": "Not an argument. Purely expository passage."}, {"@correct": "0", "#text": "Not an argument. Conditional in isolation."}], "explanation": "This counts as an argument! The first three sentences provide reasons for the \n    \tfinal sentence, which is introduced with the conclusion indicator \"so\"."}, {"content": "I had to stand up during the ride home, since all of the seats were \n\t    taken and I didn't have time to wait for\n\t    the next train.", "answer": [{"@correct": "1", "#text": "Argument"}, {"@correct": "0", "#text": "Not an argument. Conditional in isolation."}, {"@correct": "0", "#text": "Not an argument. Purely expository passage."}, {"@correct": "0", "#text": "Not an argument. Pure expression of belief."}], "explanation": "This is an argument. There are two premises (\"All the seats were taken\" and \"I didn't have\n    \ttime to wait for the next train\"). There is also a premise indicator (\"since\")."}, {"content": "The tax bill is expected to sharply reduce the number of taxpayers\n\t    who qualify for the charitable tax deduction --- a big driver of gifts\n\t    to nonprofits. One study predicts that donations will fall by at least\n\t    $13 billion, about 4.5 percent, next year. That decline is expected to\n\t    be concentrated among gifts from the middle of the income scale.", "answer": [{"@correct": "1", "#text": "Not an argument. Purely expository passage."}, {"@correct": "0", "#text": "Argument."}, {"@correct": "0.5", "#text": "Not an argument. Conditional in isolation."}, {"@correct": "0.5", "#text": "Not an argument. Pure expression of belief."}], "explanation": "This is not an argument. It is best classified as a *purely expository passage*.        \n\t    It presents the reader with information, but provides no reasons to accept that information."}, {"content": "I believe you should brush your teeth every night. \n\t    When I was little I was taught to do this.", "answer": [{"@correct": "1", "#text": "Not an argument. Pure statement of belief."}, {"@correct": "0", "#text": "Valid argument."}, {"@correct": "0.5", "#text": "Not an argument. Conditional in isolation."}, {"@correct": "0.5", "#text": "Not an argument. Expository passage."}], "explanation": "This is not an argument. It is best classified as a \n\t    *pure statement of belief*. \n\t    Its purpose is to convey a personal belief but it does not\n\t    provide any reasons for others to think that belief is true."}, {"content": "It's important to save money; you never know what sort of financial\n\t    obligations you might run into without warning. It's easy to open a\n\t    savings account in addition to your checking account, and it makes\n\t    saving money pretty simple. So, that's why I think you should do it.", "answer": [{"@correct": "1", "#text": "Argument."}, {"@correct": "0", "#text": "Not an argument. Pure expression of belief."}, {"@correct": "0", "#text": "Not an argument. Purely expository."}, {"@correct": "0", "#text": "Not an argument. Only makes one assertion."}], "explanation": "This is an argument. It seems to be expressing a belief, but it's\n\t    providing reasons for that belief. The conclusion is at the end and is\n\t    introduced by the conclusion indicator \"so\"."}, {"content": "The human history of Yellowstone National Park in the United States\n\t    begins at least 11,000 years ago when Native Americans began to hunt and\n\t    fish in the region. During the construction of the post office in\n\t    Gardiner, Montana, in the 1950s, an obsidian projectile point of Clovis\n\t    origin was found that dated from approximately 11,000 years ago.", "answer": [{"@correct": "1", "#text": "Not an argument. Purely expository passage."}, {"@correct": "0", "#text": "Argument."}, {"@correct": "0.5", "#text": "Not an argument. Conditional in isolation."}, {"@correct": "0.5", "#text": "Not an argument. Pure expression of belief."}], "explanation": "This is not an argument. It is best classified as a *purely expository passage*.        \n\t    It presents the reader with information, but provides no reasons to accept that information."}, {"content": "Jamie's party starts at eight o'clock on Saturday. Jamie throws a\n\t    party every year on the first Saturday of June. He is planning to\n\t    barbecue if it doesn't rain.", "answer": [{"@correct": "1", "#text": "Not an argument. Purely expository passage."}, {"@correct": "0", "#text": "Argument."}, {"@correct": "0.5", "#text": "Not an argument. Conditional in isolation."}, {"@correct": "0.5", "#text": "Not an argument. Pure expression of belief."}], "explanation": "This is not an argument. It's best classified as a *purely expository passage*.\n\t    It provides information, but doesn't provide any reason to accept the assertions\n\t    as true aside from the speaker's authority."}, {"content": "The victory for the Georgia Bulldogs on Monday wasn't easy. It was\n\t    the first overtime game in the 104-year history of the Rose Bowl, the\n\t    highest-scoring Rose Bowl ever and the first College Football Playoff\n\t    game to go into overtime.", "answer": [{"@correct": "1", "#text": "Argument"}, {"@correct": "0", "#text": "Not an argument. Purely expository passage."}, {"@correct": "0", "#text": "Not an argument. Conditional in isolation"}, {"@correct": "0", "#text": "Not an argument. Pure expression of belief."}], "explanation": "This counts as an argument! The conclusion is the first sentence. The\n\t    next sentence contains three separate reasons supporting the conclusion."}, {"content": "If the Trump Administration does not initiate a first strike against\n\t    North Korea, and the North Koreans do not unduly provoke the United\n\t    States or South Korea, a catastrophic war will be averted.", "answer": [{"@correct": "1", "#text": "Not an argument. Conditional in isolation."}, {"@correct": "0", "#text": "Argument."}, {"@correct": "0.5", "#text": "Not an argument. Purely expository passage."}, {"@correct": "0.5", "#text": "Not an argument. Pure expression of belief."}], "explanation": "This is not an argument. It is a single conditional (\"if-then\") statement."}, {"content": "When you push on the gas pedal, it opens the engine's throttle.\n\t    When the throttle opens, the engine is able to suck in more of the\n\t    fuel/air mixture. When the engine is able to suck in more of the\n\t    fuel/air mixture, the explosions in its combustion chambers are more\n\t    forceful. When the explosions in the combustion chambers are more\n\t    forceful, the engine turns faster and more powerfully. When the engine\n\t    turns faster and more powerfully, the car tends to accelerate. From all\n\t    this, it follows that when you push on the gas pedal, the car tends to\n\t    accelerate.", "answer": [{"@correct": "1", "#text": "Argument"}, {"@correct": "0", "#text": "Not an argument. Purely expository passage."}, {"@correct": "0", "#text": "Not an argument. Conditional in isolation."}, {"@correct": "0", "#text": "Not an argument. Pure expression of belief."}], "explanation": "This counts as an argument! The conclusion is the final assertion, \n\t    and is introduced by the conclusion indicating phrase \"from all this, \n\t    it follows that\". The first five sentences are the premises."}, {"content": "P1) If the Nazis had won World War II, Germany would now rule the world.\n\t    \n\t    P2) The Nazis lost World War II.\n\t    \n\t    C) Therefore, Germany does not now rule the world.", "answer": [{"@correct": "1", "#text": "Invalid"}, {"@correct": "0", "#text": "Valid"}], "explanation": "This argument is *invalid*. Even if both premises were true, the conclusion\n\t    could still be false!\n\n\t    Here's how that could happen. Suppose the Nazis' goal was world\n\t    domination, so if they had won WWII, Germany would now rule the world.\n\t    But the Nazis lost WWII. Do these things together imply that the Nazis\n\t    do NOT now rule the world? No! (Even though of course the Nazis do not\n\t    actually rule the world, we can imagine that even though they lost WWII, Germany\n\t    wound up ruling the world anyway. Just suppose that shortly after losing World War II, they\n\t    started World War III and won that war, and now sadly the Nazis rule the world.\n\t    Awful scenario, but not one that is contradicted by the argument's premises!)"}, {"content": "P1) Joey does not know a single word of Spanish.\n\t    \n\t    C) Therefore, Joey will not respond in perfect Spanish if asked a question in\n\t    Spanish.", "answer": [{"@correct": "1", "#text": "Invalid"}, {"@correct": "0", "#text": "Valid"}], "explanation": "This is an *invalid* argument! \n\n\t    The conclusion *could* turn out false even if the premise\n\t    were true! (Joey might not know a single word of Spanish, but \n\t    through sheer luck he might reply in perfect Spanish if he were asked\n\t    a question in Spanish!)"}, {"content": "P1) If the cows will come home tonight, then we will have fresh\n\t    milk tomorrow.\n\t    \n\t    P2) We will have fresh milk tomorrow.\n\t    \n\t    C) Therefore, the cows will come home tonight.", "answer": [{"@correct": "1", "#text": "Invalid"}, {"@correct": "0", "#text": "Valid"}], "explanation": "This argument is *invalid*. \n\n\t    To be valid, it must be IMPOSSIBLE for the conclusion to be \n\t    true if the premises are all true, but that's not what we have here.\n\t    Suppose both premises are true. So, let's assume that yes, it's true\n\t    that IF the cows come home, THEN we'll have fresh milk tomorrow, AND, yes,\n\t    we assume that we WILL have fresh milk tomorrow... do these things\n\t    NECESSARILY IMPLY the cows will come home? No! Maybe tomorrow\n\t    they won't come home and we'll have to go buy fresh milk."}, {"content": "P1) Teresa is in Tulsa Oklahoma.\n\t    \n\t    C) Therefore, Either Teresa is in Tulsa Oklahoma, or she is in Lincoln Nebraska.", "answer": [{"@correct": "1", "#text": "Valid"}, {"@correct": "0", "#text": "Invalid"}], "explanation": "This argument is *valid*. \n\n\t    If the premise is true, and Teresa IS in Tulsa, then \n\t    it HAS to be true that she is in Tulsa OR Lincoln. Compare: if \n\t    you *are at home*, then surely it's true that EITHER you are \n\t    at home OR on the planet Mars!"}, {"content": "P1) All of the paint Sam bought is completely bright red.\n\t    \n\t    C) Therefore, the paint Sam bought is not solid black.", "answer": [{"@correct": "1", "#text": "Valid"}, {"@correct": "0", "#text": "Invalid"}], "explanation": "This counts as valid!\n\n\t    If we assume it's true that all the paint Sam bought really is completely bright red,\n\t    it cannot conceivably also be solid black! (Try to imagine something being\n\t    BOTH bright red AND solid black at the same time...)"}, {"content": "P1) Some analysts predict that the polls will be unreliable in future elections.\n\t    \n\t    P2) The polls were wrong about the most recent election.\n\t    \n\t    C) Therefore, the polls will be unreliable in the next election.", "answer": [{"@correct": "1", "#text": "Invalid"}, {"@correct": "0", "#text": "Valid"}], "explanation": "This argument is *invalid*. \n\n\t    It is possible for the conclusion to be false even if BOTH\n\t    premises are assumed TRUE. Even if we assume that the polls\n\t    were wrong in the previous \n\t    election and that some experts predict they'll be wrong\n\t    in the next election, it still possible\n\t    for the polls to be reliable in the next election!"}, {"content": "P1) The number I'm thinking of is between 100 and 200.\n\t    \n\t    P2) The number I'm thinking of is a multiple of 5.\n\t    \n\t    C) Therefore, the number I'm thinking of is between 110 and 190.", "answer": [{"@correct": "1", "#text": "Invalid"}, {"@correct": "0", "#text": "Valid"}], "explanation": "This argument counts as *invalid*. \n\n\t    Both premises could be true and the number I'm thinking of could be 105 or 195,\n\t    neither of which are between 110 and 190."}, {"content": "P1) Tom thinks the movie was great.\n\t    \n\t    P2) Darnell thinks the movie was terrible.\n\t    \n\t    C) Therefore, the movie was neither great nor terrible.", "answer": [{"@correct": "1", "#text": "Invalid"}, {"@correct": "0", "#text": "Valid"}], "explanation": "This argument is *invalid*.\n\n\t    Logically, it is possible for the movie to actually be (objectively) great,\n\t    even though Tom and Darnell disagree about it. (Logic doesn't assume that there\n\t    is no such thing as objective greatness!)"}, {"content": "P1) The point is at the center of a circle.\n\t    \n\t    C) Therefore, the point is not at the center of a square.", "answer": [{"@correct": "1", "#text": "Invalid"}, {"@correct": "0", "#text": "Valid"}], "explanation": "This argument is *invalid*. \n\n\t    To see why, just picture a circle perfectly inscribed inside a square (i.e., \n\t    touching it at only four points)."}, {"content": "P1) If Alabama wins the national championship, Tom will do a backflip.\n\t    \n\t    P2) Tom will not do a backflip.\n\t    \n\t    C) Therefore, Alabama will not win the national championship.", "answer": [{"@correct": "1", "#text": "Valid"}, {"@correct": "0", "#text": "Invalid"}], "explanation": "This argument is *valid*! \n\n\t    This is an instance of Modus Tollens! Modus Tollens is the following pattern:\n\n\t    Premise) Not B.\n\t    \n\t    Premise) If A, then B.\n\n\t    Conclusion) Therefore, not A.\n\n\t    Note: the order of the premises does not matter. \n\n\t    Remember: *any* instance of Modus Tollens is valid. (Check for yourself\n\t    that this argument is an instance of Modus Tollens!) \n\t    We can also check that this is valid by trying to \n\t    imagine the conclusion being false despite both premises being true. If you do \n\t    I think you'll find that if the conclusion is false one of the premises MUST\n\t    be false as well. (But don't take my word for it; try it!)"}, {"content": "P1) The thermometer in the window says it's below zero outside.\n\n\t    P2)\tI can see snow falling outside through the window.\n\t    \n\t    C) Therefore, it is cold outside.", "answer": [{"@correct": "1", "#text": "Invalid"}, {"@correct": "0", "#text": "Valid"}], "explanation": "This argument is *invalid*.\n            \n\t    It seems bizarre to imagine it not being cold despite both of those\n\t    premises being true, but it is conceivable! The thermometer might just be\n\t    broken (the premise can still be true---it just says that the thermometer \n\t    SAYS it's below zero). Now let's also assume you can see snow outside.\n\t    Experience teaches us that snow (i.e., crystalline water bits\n\t    falling from the clouds) does not form\n\t    in the heat, but that doesn't mean we can't imagine water \n\t    crystallizing in the heat and falling from the clouds! (Logic is not bound by \n\t    the laws of nature, only by what is conceivable!)"}, {"content": "The Burj Khalifa is shorter than the Empire State Building. Here’s\n\t    why this is the case. The tallest building in the world is the\n\t    Empire State Building. If the tallest building in the world is the\n\t    Empire State Building, then the Burj Khalifa is shorter than the\n\t    Empire State Building.", "answer": [{"@correct": "1", "#text": "This is a valid instance of Modus Ponens."}, {"@correct": "0.5", "#text": "This is a valid instance of Modus Tollens."}, {"@correct": "0", "#text": "This is invalid, but it has inductive support."}, {"@correct": "0", "#text": "This is invalid, with no inductive support."}], "explanation": "This is a *valid* argument, and is an instance of *Modus Ponens!*\n\n\t    Modus Ponens is the following pattern:\n\n\t    Premise) If A, then B.\n\n\t    Premise) A.\n\n\t    Conclusion) Therefore, B.\n\n\t    Note: the premises can be in either order.\n\n\t    Check for yourself that this argument fits this pattern!"}, {"content": "Crater Lake, the deepest lake in the United States, was caused by a huge volcanic eruption 7,700\n\t    years ago. Since human beings have lived close to the mountain for more than 10,000 years, it\n\t    follows that at least one human witnessed that eruption.", "answer": [{"@correct": "1", "#text": "This is an invalid argument."}, {"@correct": "0", "#text": "This is a valid argument, and is an instance of Modus Ponens."}, {"@correct": "0", "#text": "This is a valid argument, and is an instance of Hypothetical Syllogism."}, {"@correct": "0", "#text": "This is a valid argument, and is an instance of Multiple Modus Ponens."}], "explanation": "This is an *invalid* argument! \n\n\t    The conclusion is that some human witness the huge volcanic eruption that created Crater Lake\n\t    7,700 years ago. The premises are that the lake was caused by an eruption 7,700 years ago, and that\n\t    humans have lived close to the mountain for more than 10,000 years. But those two premises together,\n\t    even if we assume they are both true, do not necessarily imply that anyone saw the eruption. Maybe\n\t    the people were all away on vacation!"}, {"content": "The earth is either flat or round. Also, the moon is made of cheese if the earth is\n\t    flat. The earth is not round. Hence, we may infer that the moon is made of cheese.", "answer": [{"@correct": "1", "#text": "Valid Argument"}, {"@correct": "0", "#text": "Invalid Argument"}, {"@correct": "0", "#text": "Purely expository passage"}, {"@correct": "0", "#text": "Conditional in isolation"}], "explanation": "This argument is *valid*. \n\n\t    Remember: validity means deductive support, which is about the logical connection between\n\t    the premises and the conclusion, not about whether the premises are actually true! We can\n\t    verify that this argument has deductive support by imagining all the premises are true\n\t    and working out what must follow from them. We assume the earth is flat or round \n\t    and that it is NOT round. So we can infer that the earth is flat. Then we assume that\n\t    the earth is made of cheese if it is flat. Well, we've concluded already that it's flat,\n\t    so we must conclude that it is made of cheese! (Remember: we're just working through the \n\t    logic, we know the premises are actually false, but we're *assuming* they're true for the \n\t    moment to check the reasoning!)"}, {"content": "We can infer that Sean goes to the college, because everyone at the college knows Tom and Sean knows Tom.", "answer": [{"@correct": "1", "#text": "Invalid Argument"}, {"@correct": "0", "#text": "Valid Argument"}, {"@correct": "0", "#text": "Conditional in isolation"}, {"@correct": "0", "#text": "Purely expository passage"}], "explanation": "This is an *invalid* argument. \n\n\t    We can see that it is invalid because we can check that\n\t    the conclusion could be false even though both premises are true.\n\t    Suppose it's true that everyone at the college knows Tom\n\t    and that Sean knows Tom. Do these things necessarily \n\t    imply that Sean goes to the college? No! It's possible Sean \n\t    never went to college and is just Tom's friend from high school."}, {"content": "The fastest way to drive to Alabama is to take the Interstate south\n\t    through New York and then through Virginia. Most of the drive\n\t    will go down the Appalachian Mountains. When you get to North\n\t    Carolina, stop at a Waffle House and order a plate of pecan\n\t    waffles.", "answer": [{"@correct": "1", "#text": "Not an argument. Mostly expository with a command."}, {"@correct": "0", "#text": "Valid Argument"}, {"@correct": "0", "#text": "Invalid Argument"}, {"@correct": "0", "#text": "Not an argument. Conditional in isolation."}], "explanation": "This is not an argument. The first two assertions \n\t    seem to just be offering information (without giving any \n\t    reasons to accept the information other than the speaker's authority).\n\t    The final sentence is a command."}, {"content": "If Alice the cat is nice, then she deserves kindness.\n\t    If she deserves kindness, then you should pet her. So, if Alice\n\t    the cat is nice, you should pet her!", "answer": [{"@correct": "1", "#text": "This is valid, and is an instance of Hypothetical Syllogism"}, {"@correct": "0", "#text": "This is an invalid argument."}, {"@correct": "0.5", "#text": "This is valid, and is an instance of Modus Ponens."}, {"@correct": "0", "#text": "This is a conditional in isolation."}], "explanation": "This is an instance of *Hypothetical Syllogism*, and (remember!)\n\t    every instance of Hypothetical Syllogism is valid.\n\n\t    Hypothetical Syllogism is this pattern:\n\n\t    Premise) If A, then B.\n\n\t    Premise) If B, then C.\n\n\t    Conclusion) Therefore, if A, then C.\n\n\t    You can check for yourself that this argument is an instance!"}, {"content": "The golden rule of logic says...", "answer": [{"@correct": "1", "#text": "If an argument is valid, and you deny its conclusion,\n\t    then you must also deny at least one of its premises."}, {"@correct": "0", "#text": "If an argument is valid, and you deny one of its premises,\n\t    then you must also deny its conclusion."}, {"@correct": "0", "#text": "You must do unto others as you would have them do unto you."}, {"@correct": "0", "#text": "If you don't like an argument, then you should reject\n\t    its conclusion."}], "explanation": "When an argument is valid, that means that its conclusion MUST \n\t    be true IF ALL of its premises are true. In other words, there's no\n\t    way its conclusion can be false if all of its premises are true!\n\t    Therefore, it is self-contradictory to accept all the premises in a valid\n\t    argument and deny the conclusion. When an argument is valid you have\n\t    to either accept the conclusion or deny a premise!"}, {"content": "If inflation heats up, then interest rates will rise. But, if\n\t    interest rates rise, then bond prices will decline. In view of\n\t    this, we should conclude that if inflation heats up, then\n\t    bond prices will decline.", "answer": [{"@correct": "1", "#text": "This is a valid instance of Hypothetical Syllogism."}, {"@correct": "0.5", "#text": "This is a valid instance of Modus Ponens."}, {"@correct": "0", "#text": "This is invalid, but does have inductive support."}, {"@correct": "0", "#text": "This is not an argument. It is a conditional in isolation."}], "explanation": "This is an instance of *Hypothetical Syllogism*, and (remember!)\n\t    every instance of Hypothetical Syllogism is valid.\n\n\t    Hypothetical Syllogism is this pattern:\n\n\t    Premise) If A, then B.\n\n\t    Premise) If B, then C.\n\n\t    Conclusion) Therefore, if A, then C.\n\n\t    You can check for yourself that this argument is an instance!"}, {"content": "There can be arguments that have the Modus Ponens structure but that are *invalid*.", "answer": [{"@correct": "1", "#text": "False"}, {"@correct": "0", "#text": "True"}], "explanation": "Modus Ponens is a *valid argument form*. This means that \n\t    *any instance* of it will be a valid argument. We can see why this\n\t    is the case if we think about the structure. \n\n\t    Premise) If A, then B.\n\n\t    Premise) A.\n\n\t    Conclusion) Therefore, B.\n\n\t    Remember, to say that this is a valid form means that no matter what\n\t    A and B are (they can be any declarative sentences!), the conclusion of this\n\t    CANNOT be false if BOTH premises are true! (If you're unsure: \n\t    make up your own instance of Modus Ponens with a *conclusion* you know to be \n\t    *false* --- you will see that one of the two premises you made is false as well!)"}, {"content": "Massachusetts is in New England, and if Boston is in New England, then \n\t    Boston is in the USA. Therefore, Boston is in the USA.", "answer": [{"@correct": "1", "#text": "Invalid Argument"}, {"@correct": "0", "#text": "Valid Argument in Modus Ponens form"}, {"@correct": "0", "#text": "Valid Argument in Hypothetical Syllogism form"}, {"@correct": "0", "#text": "Purely expository passage"}], "explanation": "This is an *invalid* argument. (Its two premises are contained in the\n\t    first sentence, and its conclusion comes after the conclusion indicator \"therefore\".)\n\n\t    Remember: whether are argument is valid does not depend on whether \n\t    the premises (or the conclusion) are *in fact true*. So, even though both premises of this argument\n\t    are true (and so is the conclusion!), that fact has no bearing on whether the argument is valid! Whether an\n\t    argument is valid is a question solely about the logic --- the reasoning itself ---\n\t    that connects the premises to the conclusion; an argument is valid when \n\t    we can truthfully assert one (or both) of the following \n\t    conditional statements:\n\n\t    *If* the argument's premises are *all true*, then the conclusion *must be true too*.\n\n\t    *If* the argument's premises were *all true*, then the conclusion *would have to be true too*.\n\n\t    We cannot truthfully assert these of the argument above. Of course it is true\n\t    that MA is in New England and that if Boston is in New England then it is \n\t    in the USA. But do those two things together necessarily imply that\n\t    Boston is in the USA? No! As far as the premises are concerned, Boston could\n\t    be located anywhere! (The first premise doesn't mention Boston at all, \n\t    and the second premise only says that *if* Boston is in New England...)"}, {"content": "An argument is sound if and only if...", "answer": [{"@correct": "1", "#text": "It is valid and its premises are all true."}, {"@correct": "0", "#text": "Its premises are all true and it is inductive."}, {"@correct": "0", "#text": "Its premises and its conclusion are all true."}, {"@correct": "0", "#text": "It is valid and its conclusion is true."}], "explanation": "Soundness is validity plus true premises. When an argument is \n\t    sound, its conclusion *must be true*. (Sound arguments are sometimes\n\t    referred to as *proofs*.)"}]}}
